output/posts/generative-model-and-descriminative-model/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>生成模型和判定模型 | Astropeak</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://astropeak.github.io/posts/generative-model-and-descriminative-model/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Astropeak">
<link rel="prev" href="../nlp-vocabulary/" title="自然语言处理名词表" type="text/html">
<link rel="next" href="../hmm-word-segmentation/" title="基于隐马尔科夫模型的中文分词方法" type="text/html">
<meta property="og:site_name" content="Astropeak">
<meta property="og:title" content="生成模型和判定模型">
<meta property="og:url" content="https://astropeak.github.io/posts/generative-model-and-descriminative-model/">
<meta property="og:description" content="统计概率模型的作用是给定输入 \(x\) ， 预测输出 \(y\) 的概率，也即求解条件概率 \(P(y|x)\) 。统计概率模型分为两种：生成模型（Generative Model）和判定模型（Descriminative Model）。


如果模型学习的是 \(P(x, y)\) 的联合概率分布，则这个模型是生成模型。求得 \(P(x, y)\) 后，根据贝叶斯定律，可间接求得 



\(">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-04-23T00:00:00+08:00">
<meta property="article:tag" content="machine learning">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://astropeak.github.io/">

                <span id="blog-title">Astropeak</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">生成模型和判定模型</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Astropeak
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-04-23T00:00:00+08:00" itemprop="datePublished" title="2017-04-23">2017-04-23</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
统计概率模型的作用是给定输入 \(x\) ， 预测输出 \(y\) 的概率，也即求解条件概率 \(P(y|x)\) 。统计概率模型分为两种：生成模型（Generative Model）和判定模型（Descriminative Model）。
</p>
<ul class="org-ul">
<li>如果模型学习的是 \(P(x, y)\) 的联合概率分布，则这个模型是生成模型。求得 \(P(x, y)\) 后，根据贝叶斯定律，可间接求得 
</li>
</ul>
<p>
\(P(y|x) = \frac{P(x, y)}{P(x)}\) 。
</p>
<ul class="org-ul">
<li>如果模型学习的是 \(P(y|x)\) 的条件概率分布，则这个模型是判定模型。此时是直接求解。
</li>
</ul>
<p>
常见的生成模型和判定模型如下
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="left">
<col class="left">
</colgroup>
<thead><tr>
<th scope="col" class="left">生成模型</th>
<th scope="col" class="left">判定模型</th>
</tr></thead>
<tbody>
<tr>
<td class="left">朴素贝叶斯</td>
<td class="left">罗辑斯谛回归</td>
</tr>
<tr>
<td class="left">隐马尔科夫模型</td>
<td class="left">条件随机场</td>
</tr>
</tbody>
</table>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">为什么叫生成模型</h2>
<div class="outline-text-2" id="text-1">
<p>
  生成模型的中的生成表示: 根据训练数据, 模型学习给定 \(y\) 生成 \(x\) 的概率，即学习 \(P(x|y)\) 。以朴素贝叶斯为例，
求解公式为
</p>
  \begin{equation}
y^* = \underset{y}{\operatorname{argmax}} P(y|x) = \underset{y}{\operatorname{argmax}} P(x|y)P(y)
\end{equation}

<p>
\(P(x|y)\) 表示给定分类 \(y\) ，来预测可能的 \(x\) 值，或者生成 \(x\) 的值。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">区别</h2>
<div class="outline-text-2" id="text-2">
<p>
判定模型由于是直接学习 \(P(y|x)\) ，因此在相同数目的训练数据条件下，通常其预测效果要好于生成模型。
</p>

<p>
生成模型的功能更加强大。
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/machine-learning/" rel="tag">machine learning</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../nlp-vocabulary/" rel="prev" title="自然语言处理名词表">Previous post</a>
            </li>
            <li class="next">
                <a href="../hmm-word-segmentation/" rel="next" title="基于隐马尔科夫模型的中文分词方法">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2018         <a href="mailto:astropeak@gmail.com">Astropeak</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
